In [1]:
import pandas as pd

In [2]:
## Series

data=[1,2,3,4,5]
series=pd.Series(data)
print(series)

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [3]:
## Create a series from dict elements
data={'a':1,'b':2,'c':3}
series_dict=pd.Series(data)
print(series_dict)

a    1
b    2
c    3
dtype: int64

In [4]:
series_dict['a']
series_dict['c']

3

In [5]:
data=[10,20,30]
index=['a','b','c']
pd.Series(data,index=index)

a    10
b    20
c    30
dtype: int64

In [6]:
## Dataframe

data ={
    'Name':['Krish','John','Jack'],
    'Age':[25,30,35],
    'City':['Banglore','New York','Florida']
}

df=pd.DataFrame(data)
print(df)

    Name  Age      City
0  Krish   25  Banglore
1   John   30  New York
2   Jack   35   Florida

In [7]:
import numpy as np
np.array(df)

array([['Krish', 25, 'Banglore'],
       ['John', 30, 'New York'],
       ['Jack', 35, 'Florida']], dtype=object)

In [8]:
## Create a df from list of dictionaries

data=[
    {'Name':'Krish','Age':25,'City':'Banglore'},
    {'Name':'John','Age':22,'City':'Mumbai'},
    {'Name':'Jack','Age':25,'City':'Pune'}
]
df=pd.DataFrame(data)
df

    Name  Age      City
0  Krish   25  Banglore
1   John   22    Mumbai
2   Jack   25      Pune

In [9]:
df['Name']

0    Krish
1     John
2     Jack
Name: Name, dtype: object

In [10]:
df.loc[0]           ## loc gives row

Name       Krish
Age           25
City    Banglore
Name: 0, dtype: object

In [18]:
df.loc[0][0]

C:\Users\hp\AppData\Local\Temp\ipykernel_53984\2527876973.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df.loc[0][0]

'Krish'

In [22]:
## Accesing Specified element

print(df.at[1, 'Age'])
print(df.at[0, 'Name'])

22
Krish

In [25]:
## Using iat

print(df.iat[2,2])
print(df.iat[0,2])

Pune
Banglore

In [26]:
# Data manipulation
df

    Name  Age      City
0  Krish   25  Banglore
1   John   22    Mumbai
2   Jack   25      Pune

In [33]:
df['Salary']=[5000,6000,7000]

In [34]:
df

    Name  Age      City  Salary
0  Krish   25  Banglore    5000
1   John   22    Mumbai    6000
2   Jack   25      Pune    7000

In [35]:
df.drop(columns=['Salary'],axis=1)

    Name  Age      City
0  Krish   25  Banglore
1   John   22    Mumbai
2   Jack   25      Pune

In [36]:
df

    Name  Age      City  Salary
0  Krish   25  Banglore    5000
1   John   22    Mumbai    6000
2   Jack   25      Pune    7000

In [37]:
df.drop(columns=['Salary'],axis=1,inplace=True)
df

    Name  Age      City
0  Krish   25  Banglore
1   John   22    Mumbai
2   Jack   25      Pune

In [38]:
# Updating value
df['Age'] = df['Age']+1
df

    Name  Age      City
0  Krish   26  Banglore
1   John   23    Mumbai
2   Jack   26      Pune

In [39]:
df.head(2)  # First 2 rows

    Name  Age      City
0  Krish   26  Banglore
1   John   23    Mumbai

In [40]:
df.tail(2)  # Bottom 2 values

   Name  Age    City
1  John   23  Mumbai
2  Jack   26    Pune